from  func_format_numbers import *

a,b,n = per()

if a == 2:
    if b == 10:
        print(f'{n} в двоичной системе исчисления = {to_dec(int(n))} в десятичной системе исчисления')
    else:
        print(f'{n} в двоичной системе исчисления = {to_six(to_dec(int(n)))} в шестнадцатиричной системе исчисления')
elif a == 10:
    if b == 2:
        print(f'{n} в десятичной системе исчисления = {to_bin(int(n))} в двоичной системе исчисления')
    else:
        print(f'{n} в десятичной системе исчисления = {to_six(int(n))} в шестнадцатиричной системе исчисления')
elif a == 16:
    if b == 10:
        print(f'{n} в шестнадцатиричной системе исчисления = {to_dec_from_six(n)} в десятичной системе исчисления')
    else:
        print(f'{n} в шестнадцатиричной системе исчисления = {to_bin(to_dec_from_six(n))} в двоичной системе исчисления')
